//　マップ初期配置、マップシナリオ
// test stage 2
function mapSce_stage2() {

	var ms = 
//  開始フレーム,座標,,角度,シナリオ,キャラ
	[[-1, 240 * 0.875, 608 * 0.75, 0, 8, 0],
	[-1, 208 * 0.875, 608 * 0.75, 0, 17, 10],
	[-1, 272 * 0.875, 608 * 0.75, 0, 17, 10],
	[-1, 240 * 0.875, 240 * 0.75, 0, 28, 18],
	[-1, 320 * 0.875, 320 * 0.75, 0, 29, 19]];

	var x = Math.floor(Math.random() * 360) + 40;

	ms.push([10, x, 0, 180 + Math.floor(Math.random() * 40) - 20, "ememy_moveshot_1", 1]);

    for (var i = 100 ; i < 500 ; i += 20 ){

        x = Math.floor(Math.random()*360);

        ms.push([i, x, 0, 180 + Math.floor(Math.random() * 40) - 20, "ememy_moveshot_1", 1]);


        if (i % 180 == 0) {
            ms.push([i, 210, 0, 180, "common_vset6", 7]);
        }

    }

    for (var i = 0; i < 500; i += 60) {

        var x = Math.floor(Math.random() * 360);

        if (i % 180 == 0) {
            ms.push([i + 500, 210, 0, 180, "common_vset6", 7]);
        }

        ms.push([i + 500, x, 0, 180 + Math.floor(Math.random() * 40) - 20, "sce_ememy_randomshot", 1]);
    }

/*
	[  50,240,  0,180,11, 1],
	[ 100,440,140,225,10, 1],
	[ 100, 40,140,135, 9, 1],
	[ 120,440,140,225,10, 1],
	[ 120, 40,140,135, 9, 1],
	[ 140,440,140,225,10, 1],
	[ 140, 40,140,135, 9, 1],
	[ 160,440,140,225,10, 1],
	[ 160, 40,140,135, 9, 1],
	[ 180,440,140,225,10, 1],
	[ 180, 40,140,135, 9, 1],
	[ 250,140,000,180, 2, 1]
	[ 250,340,000,180, 3, 1],
	[ 280,140,000,180, 2, 1],
	[ 280,340,000,180, 3, 1],
	[ 310,140,000,180, 2, 1],
	[ 310,340,000,180, 3, 1],
	[ 340,140,000,180, 2, 1],
	[340, 340, 000, 180, 3, 1],
	[440, 479,200,270, 15, 1],
	[500,   1,220,90, 15, 1],
	[ 700,240,  0,180,23,14],
	[ 900,120,  0,180,19, 1],
	[ 900,360,  0,180,19, 1],
*/

	ms.push([1120,0,  0,180,37, 2]); //eventmessagetest
	ms.push([1500, 210, 40, 180, 34, 14]); //回転ボス
	ms.push([1600, 0, 0, 180, 53, 2]); //endmessage
	ms.push([1700, 0, 0, 180, 54, 2]); //result画面要求

	ms.push([1800, -1, -1,180, 0, 4]);
	ms.push([600000,-1,-1,  0, 0, 0]);
//
// フレームカウントでソートされていること。

	var map_sc = []; //　出現パターン

	for (var j in ms){
		var w = ms[j];
    	
    		var ptn = {};
    	
    		ptn.count = w[0];
    		ptn.x = w[1];
    		ptn.y = w[2]; 
    		ptn.r = w[3];
    		ptn.sc = w[4];
    		ptn.ch = w[5];
    	
    		map_sc.push( ptn ); 
	}
return map_sc;

}

function mapBgImage_stage2() {

    var tex_bg = new Image();
    tex_bg.src = "pict/space.jpg";

    return tex_bg;
}